#### AnalyticalBusData Members

---

|  |
| --- |
| AnalyticalBusData Class   Methods   Properties   See Also |

The  AnalyticalBusData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  AnalyticalDistributionNodePropertyData  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CurrentRating | The current rating value of the analytical bus. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  AnalyticalDistributionNodePropertyData  .) |
| Public property | NumberOfPhases | The number of phases. (Inherited from  AnalyticalDistributionNodePropertyData  .) |
| Public property | TotalConnectedCurrent | The total connected current of the analytical bus. |
| Public property | Voltage | The voltage value of the analytical bus. |

# See Also

AnalyticalBusData Class

Autodesk.Revit.DB.Electrical Namespace